app/views/sessions/new.html.erb

SELECT "evaluations"."id" FROM "evaluations"
SELECT "universities"."id" FROM "universities"
SELECT "users"."id" FROM "users"
---
            <p class="logo">CLASSLION</p>
            <p class="main_msg"><%= University.ids.count %>개의 학교, <%=User.ids.count%>명의 대학생,<br><%=Evaluation.ids.count%>개의 강의평가</p>