app/views/users/new.html.erb

                    <%#= f.text_field :university_id, placeholder: '학교', data: {autocomplete_source: University.order(:local_name).map(&:local_name)} %>
                      <%= f.collection_select :university_id, University.all, :id, :local_name, {:prompt => '학교'} %><br>
---
SELECT "universities".* FROM "universities"