app/views/mypages/_my_lecture.html.erb

SELECT  1 AS one FROM "favorites" WHERE "favorites"."course_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["course_id", 4], ["user_id", 6], ["LIMIT", 1]]
---
          <%= hidden_field_tag 'f_id', user_id: @current_user.id %>
          <% if Favorite.exists?(course_id: f.id, user_id: @current_user.id) %>