app/views/courses/_evaluations.html.erb

                          <br>
                          <%= e.comments.count %> <a href="#"><%= image_tag "reply.svg", alt: "reply" %></a>
---
SELECT "comments".* FROM "comments" WHERE "comments"."evaluation_id" = ? ORDER BY "comments"."created_at" DESC  [["evaluation_id", 27]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."evaluation_id" = ?  [["evaluation_id", 27]]