app/views/courses/_like_form.html.erb

  <%# 좋아요가 아예 없는 경우, 좋아요 %>
  <% if !(Like.exists?(course_id: @course.id, user_id: @current_user.id)) %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."course_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["course_id", 7], ["user_id", 6], ["LIMIT", 1]]
SELECT  1 AS one FROM "likes" WHERE "likes"."course_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["course_id", 4], ["user_id", 6], ["LIMIT", 1]]