app/controllers/comments_controller.rb

INSERT INTO "comments" ("evaluation_id", "user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["evaluation_id", 28], ["user_id", 6], ["body", "?"], ["created_at", "2017-07-02 10:43:10.072147"], ["updated_at", "2017-07-02 10:43:10.072147"]]
---
  def create
    #댓글 생성
    @comment = Comment.new(comment_params)
    @comment.evaluation_id = params[:evaluation_id]
    @comment.user = @current_user
    #TODO
    respond_to do |format|
      if @comment.save