app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."course_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["course_id", 7], ["user_id", 6], ["LIMIT", 1]]
SELECT  1 AS one FROM "likes" WHERE "likes"."course_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["course_id", 4], ["user_id", 6], ["LIMIT", 1]]
SELECT COUNT(*) FROM "evaluations" WHERE "evaluations"."course_id" = ?  [["course_id", 4]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."course_id" = ? AND (is_like = 't')  [["course_id", 4]]
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."course_id" = ? ORDER BY "evaluations"."created_at" DESC  [["course_id", 4]]
---
  def show
    @course = Course.find(params[:id])

    #render form
    @like_exists = (Like.exists?(course_id: @course.id, user_id: current_user.id))

    #word count
    @minimum_length = 100

    #evaluation
    @evaluation = Evaluation.new
    @like = Like.new

    @evaluation_count = @course.evaluations.count
    @like_count = @course.likes.count
    @like = @course.likes.where("is_like = ?", true).count
    @dislike = @like_count - @like
    @like_per = (@like.to_f/@like_count).round(2)*100
    @dislike_per = 100 - @like_per

    @evaluated_list = []
    @current_user.evaluations.each do |e|

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    #같은 강의, 연관 강의start - refactoring 가능할지..
    @related_courses = Set.new
    @identical_courses = Set.new
    Course.where("professor_id = ?", @course.professor.id).each do |course|
      @related_courses << course.id
    end

    Course.where("lecture_id = ?", @course.lecture.id).each do |lecture|