app/controllers/evaluations_controller.rb

SELECT  "evaluations".* FROM "evaluations" WHERE (id < '25') ORDER BY id desc LIMIT ?  [["LIMIT", 2]]
---
  def recent
    load_limit = 2
    refresh_limit = 100
    if params[:since].nil? or params[:since].to_i == 0
      @evaluations = Evaluation.order("id desc").limit(load_limit)

INSERT INTO "evaluations" ("user_id", "course_id", "like_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create #디비에 넣는다
    evaluation = Evaluation.new(eval_params)
    evaluation.user = current_user
    if evaluation.save