app/controllers/mypages_controller.rb

  def index
    @evaluations = @current_user.evaluations.order(created_at: :desc)
    @comments = @current_user.comments.reverse
    @favorite_courses = []

    @current_user.favorites.each do |f|
      @favorite_courses << Course.find(f.course_id)
---
SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."user_id" = ? ORDER BY "evaluations"."created_at" DESC  [["user_id", 6]]
SELECT "comments".* FROM "comments" WHERE "comments"."evaluation_id" = ?  [["evaluation_id", 28]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 6]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]