app/controllers/mypages_controller.rb

  def index
    #자신이 쓴 강의평
    @favorite_courses = []
    @evaluations = @current_user.evaluations
    Favorite.where('user_id =?', @current_user.id).each do |f|
---
SELECT  "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]