app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "a@a.com"], ["LIMIT", 1]]
---
  def create
    #로그인 process
    user = User.find_by(email: params[:session][:email].downcase)