app/controllers/wikis_controller.rb

INSERT INTO "wikis" ("user_id", "revision", "course_id", "diff", "body", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def send_wiki
    tries = 3
    wiki = Wiki.new(      user: current_user,
                     course_id: params[:course_id],
                          body: params[:content],
                       comment: params[:comment])
  begin
    wiki.get_new_revision
    wiki.save!

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."course_id" = ? AND "wikis"."revision" = ? LIMIT ?  [["course_id", 4], ["revision", 3], ["LIMIT", 1]]
---
  def show
    if current_user.has_role?('wikier')
      @course = Course.find(params[:id]) #FE작업 중 임시추가-검토 바람
      @wiki = Wiki.where(course_id: params[:id]).where(revision: params[:revision]).take

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."course_id" = ? AND "wikis"."revision" = ? LIMIT ?  [["course_id", 4], ["revision", 1], ["LIMIT", 1]]
---
  def diff
    if current_user.has_role?('wikier')
      @course = Course.find(params[:id]) #FE작업 중 임시추가-검토 바람
      wiki_1 = Wiki.where(course_id: params[:id]).where(revision: params[:rev_1]).take

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."course_id" = ? AND "wikis"."revision" = ? LIMIT ?  [["course_id", 4], ["revision", 2], ["LIMIT", 1]]
INSERT INTO "wikis" ("user_id", "revision", "course_id", "diff", "body", "rollback", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def rollback
    tries = 3
    previous_wiki = Wiki.where(course_id: params[:id]).where(revision: params[:revision]).take
    wiki = Wiki.new(      user: current_user,
                     course_id: params[:id],
                          body: previous_wiki.body,
                      rollback: previous_wiki.revision,
                       comment: params[:comment])
  begin
    wiki.get_new_revision
    wiki.save!

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."course_id" = ? ORDER BY revision desc LIMIT ?  [["course_id", 4], ["LIMIT", 1]]
---
  def history
    if current_user.has_role?('wikier')
      @course = Course.find(params[:id]) #FE작업 중 임시추가-검토 바람
      @wiki_history = Wiki.where(course_id: params[:id]).order("revision desc")