app/controllers/wikis_controller.rb

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."course_id" = ? ORDER BY revision desc LIMIT ?  [["course_id", 4], ["LIMIT", 1]]
---
  def send_wiki
    tries = 3
    previous_wiki = Wiki.where(course_id: params[:course_id]).order("revision desc").take